name: "yolox"
platform: "tensorrt_plan"
max_batch_size: 32

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 1024, 1024 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 21504, 8 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 1, 2, 4, 8, 16, 32 ]
}

instance_group [
  {
    count: 4
    kind: KIND_GPU
    profile: [ "0", "1", "2", "3", "4", "5" ]
  }
]
