[
  {
    "document_type": "text",
    "metadata": {
      "content": "State Demography Office Colorado Demographic\r\nProfile\r\nPrint Date: 04/07/2021\r\nCommunity Profile for Adams County\r\nDemographic information is critical for making informed decisions at the local,\r\nstate and national level. This demographic profile is a summary of trends in a\r\ncommunity. The dashboard provides charts, text, data and additional links to\r\nassist in the exploration and understanding of demographic trends for counties\r\nand municipalities in Colorado. The following collection of tables and charts\r\nestablishes the context for assessing potential impacts and for decision-making.\r\nBasic Statistics\r\nThe population base and trends of an area determine the needs for housing,\r\nschools, roads and other services. The age, income, race and ethnicity, and\r\nmigration of the population of a community are all vital in planning for service\r\n1 provision. The most significant demographic transitions for Colorado and its\r\ncommunities are related to disparate growth, aging, downward pressure on\r\nincome, and growing racial and ethnic diversity.\r\nTable 1: Community Quick Facts\r\nAdams County Colorado\r\nPopulation (2019)+ 517,885 5,763,976\r\nPopulation Change (2010 to 2019)+ 74,174 713,644\r\nTotal Employment (2019)+ 277,528 3,465,676\r\nMedian Household Income^ $71,202 $72,331\r\nMedian House Value^ $307,600 $343,300\r\nPercentage of Population with Incomes lower than\r\nthe Poverty Line^\r\n10.8% 10.3%\r\nPercentage of Population Born in Colorado^ 51.9% 42.4%\r\n+Source: State Demography Office\r\n^Source: U.S. Census Bureau, 2015-2019\r\nAmerican Community Survey, Print Date:\r\n04/07/2021\r\nPopulation Trends\r\nThe tables and plots in this section highlight trends and forecasts for the total\r\npopulation in Adams County. The table shows the overall population growth\r\nrate for Adams County and the State of Colorado. Additional plots show the\r\noverall population trends, forecasts for along with the overall components of\r\nchange for Adams County.\r\nTable 2: Population Growth Rate\r\nAdams County Colorado\r\nYear Population Growth Rate Population Growth Rate\r\n1990 265,038 3,294,473\r\n1995 312,593 3.4% 3,811,074 3.0%\r\n2000 351,735 2.4% 4,338,801 2.6%\r\n2005 395,384 2.4% 4,662,534 1.4%\r\n2010 443,711 2.3% 5,050,332 1.6%\r\n2015 490,562 2.0% 5,453,996 1.5%\r\n2019 517,885 1.4% 5,763,976 1.4%\r\nNote:\r\nSource: State Demography Office, Print Date: 04/07/2021\r\nAt the end of 2019 the estimated population of Adams County was 517,885,\r\n2 an increase of 27,323 over the population in 2015. The growth rate for Adams\r\nCounty between 2015 and 2019 was 1.4 percent compared to 1.4 percent for the\r\nState of Colorado.\r\nThe population of Adams County is forecast to reach 523,714 by 2020 and 722,807\r\nby 2040. Overall, the growth rate for Adams County is expected to decrease\r\nbetween 2020 and 2040. Between 2010 and 2020 the forecast growth rate was 1.7\r\npercent, between 2020 and 2030 the forecast growth rate is 1.6 percent, while\r\nthe forecast growth rate between 2030 and 2040 is 1.7 percent. The change is\r\ndue in part to population aging and changes in the proportion of the population\r\nin childbearing ages. Note: Population forecasts are only provided for Colorado\r\ncounties.\r\n3 Components of Population Change\r\nBirths, deaths and net migration are the main components of population change.\r\nNet migration is the difference between the number of people moving into an\r\narea and the number of people moving out. Change in net migration typically\r\ncauses most of the changes in population trends because migration is more likely\r\nto experience short-term fluctuations than births and deaths. Migration also\r\ntends to be highly correlated to job growth or decline in communities where most\r\nof the residents work where they live. For many counties with negative natural\r\nincrease (more deaths than births), this makes migration especially important\r\nfor population stability and growth.\r\nOver the past five years, between 2015 and 2019, the population of Adams\r\nCounty has increased by 37,813 people. The total natural increase (births -\r\ndeaths) over this period was 24,352 and the total net migration (new residents\r\nwho moved in minus those who moved out) was 23,537. Note: Components of\r\nChange data are only available for Colorado counties.\r\nAge Characteristics\r\nEvery community has a different age profile and is aging differently. People in\r\ndifferent age groups work, live, shop, and use resources differently and these\r\ndifferences will impact the economy, labor force, housing, school districts, day\r\ncare facilities, health services, disability services, transportation, household\r\nincome, and public finance. An aging population may put downward pressure\r\non local government tax revenue due to changes in spending on taxable goods.\r\nThe age distribution of the population of Adams County and Colorado are shown\r\nhere.\r\n4 Table 3: Median Age by Sex Comparison\r\nAdams County Colorado\r\nSex Median Age MOE Median Age MOE Signficant Direction\r\nTotal 33.8 0.2 36.7 0.2 Yes Younger\r\nMale 33.2 0.2 35.8 0.1 Yes Younger\r\nFemale 34.3 0.1 37.8 0.2 Yes Younger\r\nNote:\r\nSource: U.S. Census Bureau, 2015-2019 American Community Survey, Print Date:\r\n04/07/2021\r\n5 The median age of Adams County is 3.5 years younger than the state. Women\r\nin Adams County are significantly younger than women in the state and men in\r\nAdams County are significantly younger than men in the state.\r\nThe changing age distribution of the population of Adams County for the period\r\nfrom 2010 through 2025 is shown here. The changes in proporion of different\r\ngroups can highligh the need for future planning and service provision. Many\r\nareas have a larger share of older adults, indicating the need to evaluate housing,\r\ntransportation and other needs of the senior population.\r\nThis plot shows the net migration by age in Adams County. Colorado typically\r\ndraws many young adults as migrants. Areas with colleges and resorts draw a\r\n6 number of 18 to 24 year olds. Areas with a growing economy tend to account\r\nmostly 25 to 35 year olds and areas attractive to retirees tend to draw both\r\nworkers and older adults.\r\nPopulation Characteristics: Income, Education and Race\r\nThe plots and tables in this section describe the general population characteristics\r\nof Adams County. The bars on the plots show the width of the 90 percent\r\nconfidence interval. Categories where the bars do not overlap are significantly\r\ndifferent.\r\nHousehold Income\r\nThe household income distribution plot compares Adams County to the statewide\r\nhousehold incomes. Household income comes primarily from earnings at work,\r\nbut government transfer payments such as Social Security and TANF and\r\nunearned income from dividends, interest and rent are also included. Income\r\nand education levels are highly correlated; areas that have lower educational\r\nattainment than the state will typically have lower household incomes.\r\nThe Houselold Income Source(s) Table shows household income sources and\r\namounts for housholds in Adams County. Households will have multiple sources\r\nof income, so this table is not mutually exclusive. Mean income values reflect\r\nvalues from the cited source.\r\n7 Table 4: Household Income Source(s)\r\nAdams County\r\nTotal Households Mean Income\r\nIncome Source Estimate MOE Estimate MOE\r\nAll Households 166,450 777 $78,111 $1,035\r\nWith earnings 86.6% 0.6% $86,045 $1,300\r\nWith interest, dividends or net rental income 15.7% 0.5% $17,466 $3,041\r\nWith Social Security income 22.0% 0.4% $19,511 $ 418\r\nWith Supplemental Security Income (SSI) 3.4% 0.3% $10,747 $1,259\r\nWith cash public assistance income 1.9% 0.2% $ 3,208 $ 549\r\nWith retirement income 15.7% 0.4% $26,808 $2,015\r\nNote:\r\nSource: U.S. Census Bureau, 2015-2019 American Community Survey, Print Date: 04/07/2021\r\nEducational Attainment\r\nThe education attainment plot is provided for persons older than Age 25, i.e.,\r\nthose who have likely completed their education.\r\nRace and Ethnicity\r\nThe Race Trend table shows the changing racial and ethnic composition of\r\nAdams County beginning in 2000 and continuing to the present.\r\n8 Table 5: Race Trend\r\nAdams County Colorado\r\nRace 2000 2010 2019 2000 2010 2019\r\nHispanic 28.2% 38.0% 40.0% 17.1% 20.7% 21.5%\r\nNon-Hispanic 71.8% 62.0% 60.0% 82.9% 79.3% 78.5%\r\nNon-Hispanic White 63.3% 53.2% 50.0% 74.5% 70.0% 68.1%\r\nNon-Hispanic Black 2.8% 2.8% 3.2% 3.7% 3.8% 3.9%\r\nNon-Hispanic Native American/Alaska Native 0.6% 0.6% 0.5% 0.7% 0.6% 0.5%\r\nNon-Hispanic Asian 3.1% 3.5% 3.9% 2.2% 2.7% 3.1%\r\nNon-Hispanic Native Hawaiian/Pacific Islander 0.1% 0.1% 0.1% 0.1% 0.1% 0.1%\r\nNon-Hispanic Other 0.1% 0.2% 0.1% 0.1% 0.2% 0.2%\r\nNon-Hispanic, Two Races 1.7% 1.7% 2.2% 1.7% 2.0% 2.5%\r\nTotal Population 100.00% 100.00% 100.00% 100.00% 100.00% 100.00%\r\nNote:\r\nSources\r\n1 2000: 2000 Census\r\n2 2010: 2010 Census\r\n3 2019: Source: U.S. Census Bureau, 2015-2019 American Community Survey, Print Date: 04/07/2021\r\nHousing and Households\r\nUnderstanding the current housing stock is critical for understanding how the\r\ncommunity can best address current and future demands. This section begins\r\nwith a projection of households. The projection of households is derived by\r\ncounty specific headship rates for the population by age. Beyond the numbers\r\nand characteristics, understanding the value and affordability of housing units\r\nis vital. Are the housing prices prohibitive to new families? Are the housing\r\nprices at such a high price that once the current work force ages and sells, those\r\nhousing units will most likely go into the vacation seasonal market? Or are\r\nhousing prices reasonable and suddenly the community is experiencing growth\r\nin families with children? How many total housing units are there? What types\r\nof new units are being built - multi-family vs single family?\r\n9 The Household Estimates plot shows the current and projected number of\r\nhouseholds in Adams County between 2010 and 2050.\r\nThe next several tables provide an overview of the housing stock in an area.\r\nThe availability of land and the cost of land can dictate whether housing is less\r\ndense, with a greater number of single family units or more dense with a\r\nnumber of multifamily apartments and condos. Median home values and\r\nmedian gross rents are often considerably lower than current market prices as\r\nthe values are computed from a 5-year average that runs through 2016. The\r\nnumber of people per household can offer insights as to the composition of the\r\nhouseholds . Areas with a larger number of people per household often have\r\nmore families with children under 18 or a number of roommates living together\r\nto share housing costs. Those with a smaller number of persons per household,\r\nlikely have a larger share of single-person households.\r\n10 Table 6: Housing Units: Adams County, 2019\r\nAdams County\r\nHousing Type Value\r\nTotal Housing Units 178,987\r\nOccupied Housing Units 176,427\r\nVacant Housing Units 2,560\r\nVacancy Rate 1.4%\r\nTotal Population 517,885\r\nHousehold Population 513,612\r\nGroup Quarters Population 4,273\r\nPersons per Household 2.91\r\nNote:\r\nSource: State Demography Office, Print Date: 04/07/2021\r\nTable 7: Characteristics of Housing Units\r\nAdams County\r\nOwner-Occupied Units Rental Units All Units\r\nHousing Unit Type Units Percent Units Percent Units\r\nAll Housing Units 110,208 66.2% 56,242 33.8% 166,450\r\nSingle Unit Buildings 98,853 83.4% 19,616 16.6% 118,469\r\nBuildings with 2 to 4 Units 1,271 22.2% 4,464 77.8% 5,735\r\nBuildings with 5 or More Units 2,369 7.4% 29,567 92.6% 31,936\r\nMobile Homes 7,654 74.8% 2,575 25.2% 10,229\r\nRVs, Boats, Vans, Etc. 61 75.3% 20 24.7% 81\r\nMedian Year of Construction 1990 1983 1987\r\nAverage Number of Persons Per\r\nHousehold\r\n3.07 2.87 3.00\r\nNote:\r\nSource: U.S. Census Bureau, 2015-2019 American Community Survey, Print Date:\r\n04/07/2021\r\n11 Table 8: Comparative Housing Values\r\nAdams County Colorado\r\nVariable Value Value\r\nMedian Value of Owner-Occupied Households (Current Dollars) $307,600 $343,300\r\nPercentage of Owner-Occupied Households paying 30% or more of\r\nincome on housing\r\n25.5% 22.6%\r\nPercentage of Owner-Occupied Households paying 30-49% of\r\nincome on housing\r\n16.4% 13.9%\r\nPercentage of Owner-Occupied Households paying 50% or more of\r\nincome on housing\r\n9.1% 8.7%\r\nMedian Gross Rent of Rental Households (Current Dollars) $1,346 $1,271\r\nPercentage of Rental Households paying 30% or more of income on\r\nhousing\r\n52.9% 48.4%\r\nPercentage of Rental Households paying 30-49% of income on\r\nhousing\r\n29.8% 25.4%\r\nPercentage of Rental Households paying 50% or more of income on\r\nhousing\r\n23.1% 23.0%\r\nNote:\r\nSource: U.S. Census Bureau, 2015-2019 American Community Survey, Print Date: 04/07/2021\r\n12 Commuting\r\nCommuting plays an important role in the economy of an area because not all\r\nworkers live where they work. Commuting impacts local job growth, access to\r\nemployees, and transportation infrastructure.The Commuting diagram identifies\r\nthree groups of people:\r\n• People who work in Adams County, but live elsewhere.\r\n• People who live in Adams County, but work elsewhere.\r\n• People who live and work in Adams County.\r\n13 Table 9: Commuting Patterns for Adams County\r\nLocation Count Percent\r\nResidents of Adams County working elsewhere\r\nDenver County, CO 64,859 37.1%\r\nJefferson County, CO 29,309 16.8%\r\nArapahoe County, CO 25,551 14.6%\r\nBoulder County, CO 16,488 9.4%\r\nBroomfield County, CO 9,021 5.2%\r\nWeld County, CO 7,589 4.3%\r\nDouglas County, CO 6,302 3.6%\r\nEl Paso County, CO 4,156 2.4%\r\nLarimer County, CO 3,624 2.1%\r\nGilpin County, CO 672 0.4%\r\nOther Counties 7,317 4.2%\r\nTotal 174,888 100.0%\r\nEmployees in Adams County living elsewhere\r\nDenver County, CO 34,338 22.7%\r\nArapahoe County, CO 31,052 20.5%\r\nJefferson County, CO 26,295 17.4%\r\nWeld County, CO 13,905 9.2%\r\nDouglas County, CO 8,565 5.7%\r\nBoulder County, CO 7,486 4.9%\r\nEl Paso County, CO 7,210 4.8%\r\nBroomfield County, CO 5,401 3.6%\r\nLarimer County, CO 5,355 3.5%\r\nPueblo County, CO 1,540 1.0%\r\nOther Counties 10,262 6.8%\r\nTotal 151,409 100.0%\r\nNote:\r\nSource: U.S. Census Bureau On the Map, Print Date: 04/07/2021\r\n14 The Job Growth and Net Migration plot shows the relationship between job\r\ngowth and migration in Adams County. Generally, migration patterns follow\r\nchanges in job growth demand.\r\nEmployment by Industry\r\nIdentifying the industries which may be driving the growth and change within a\r\ncommunity is a vital part of understanding community dynamics. Growth in\r\njobs often results in growth in residents from migration within a community.\r\nIdentifying the trends of growth or decline of jobs and the types of jobs available\r\nwithin the community is important.\r\nThe Estimated Firms and Jobs series created by the SDO gives a comprehensive\r\nlook at the number of firms and jobs located within Adams County. It is broad\r\nin scope, capturing both wage and salary workers as well as most proprietors\r\nand agricultural workers. A more diverse economy is typically more resilient too;\r\nwhen looking at the employment trends recently and after a recession (shaded\r\nin gray) it is also important to look at the current share of employment by\r\nindustry. Areas dependent on a single industry such as agriculture, mining or\r\ntourism can suffer from prolonged downturns due to drought, shifting demand\r\nfor commodities, and the health of the national economy.\r\n15 The total estimated jobs are subdivided into 3 categories:\r\n• Direct Basic: jobs that bring outside dollars into the community by selling\r\ngoods or services outside the county, such as manufacturing or engineering\r\nservices,\r\n• Indirect Basic: jobs that are created as the result of goods and services\r\npurchased by direct basic such as accounting services or raw material\r\ninputs, and\r\n• Local (Resident) Services: jobs that are supported when income earned\r\nfrom the base industries is spent locally at retailers or are supported by\r\nlocal tax dollars to provide services like education and public safety.\r\nThis plot shows the jobs by industry profile for Adams County. The relative rank\r\nof high-paying sectors, such as mining, information and finacial and insurance\r\nservices versus mid-range jobs (e.g., contsruction, health casre and government)\r\nand lower-paying industrices such as retail trade and accomodation and food\r\nservices, will have an impact on a counties’ overall economic health.\r\n16 Table 10: Jobs by Sector: Denver-Boulder MSA, 2019\r\nEmployment Type Number of Jobs Percentage\r\nDirect Basic Employment 1,062,706 50.4%\r\nIndirect Basic Employment 223,718 10.6%\r\nLocal Services Employment 822,195 39.0%\r\nTotal Employment 2,108,619 100.0%\r\nTotal Population, 16+ 2,598,366\r\nNote:\r\nSource: State Demography Office, Print Date: 04/07/2021\r\nSimilar to the industry employment, areas with large amounts of diversity\r\nin their base industries tend to suffer less during downturns and recover more\r\nquickly. Regional Services is a diverse base industry that encompasses all services\r\nand goods that a region sells to those in surrounding areas; examples include\r\nspecialized health care, construction, air or rail transportation, and large item\r\nretail purchases like autos or appliances. Retirees are considered basic since\r\nthey spend money from social security or other pensions, Medicare and savings.\r\nGovernment typically only includes employment in Federal Government and\r\nState Government. Tourism not only includes traditional tourist services like\r\naccommodation and food, but also includes 2nd homes, property management\r\nand transportation of tourists by airlines, car rental, car sharing and shuttles.\r\nEmployment Forecast and Wage Information\r\nUnderstanding the types of jobs forecast to grow in a community, if jobs are\r\nforecast to increase, will aid in further understanding potential changes in\r\n17 population, labor force, housing demand, and household income. Important\r\nquestions to ask include; What is the current forecast for job growth based on\r\nthe current industry mix? What types of jobs are forecast to grow? What are\r\nthe wages for those jobs? What are the labor force trends for the community?\r\nIs the labor force expected to grow or slow down?\r\nTable 11: Jobs and Population Forecast\r\nDenver-Boulder MSA\r\nYear Type Jobs Annual\r\nGrowth\r\nRate:\r\nJobs\r\nPopulation Annual\r\nGrowth\r\nRate:\r\nPopula\u0002tion\r\n2010 Estimate 1,640,122 2,797,896\r\n2015 Estimate 1,909,981 3.8% 3,077,125 2.1%\r\n2020 Forecast 2,038,139 -3.3% 3,262,245 0.8%\r\n2025 Forecast 2,288,132 1.7% 3,421,736 1.1%\r\n2030 Forecast 2,442,227 1.2% 3,629,888 1.1%\r\n2035 Forecast 2,572,854 1.0% 3,814,042 0.9%\r\n2040 Forecast 2,674,717 0.7% 3,968,209 0.7%\r\nNote:\r\nSource: State Demography Office, Print Date: 04/07/2021\r\nThe total jobs forecast and population forecast are for Denver-Boulder MSA\r\nshown here. The two lines diverge over time due to the aging of our population\r\nand continued growth in our under 18 population – two segments of the population\r\nthat are less likely to be employed. Growth in the 65 plus population in the\r\nlabor force through 2040 compared to the universe population of those over the\r\nage of 16 since labor force participation declines with age, especially among those\r\neligible for pensions or social security. Note: Statistics for the counties in the\r\nDenver Metropolitan Statistical Area (Adams, Arapahoe, Boulder, Broomfield,\r\nDenver, Douglas and Jefferson) are combined in this section.\r\n18 The unajdusted (nominal) average weekly wages for Adams County and Colorado\r\nare shown here. The gain or loss of a major employer such as a mine or a hospital\r\ncan have a significant impact on a county’s average weekly wage. These wages\r\nare shown only for jobs located within that county and do not include most\r\nproprietors. Household income can be influenced by the average weekly wage,\r\nbut in areas that have considerable amounts commuting or unearned income\r\nthis relationship is not particularly strong.\r\nThis table compares the forecast residential labor force to the forecast population\r\nof person age 16 and older for Adams County.\r\nTable 12: Forecast Resident Labor Force and Population, Age 16 +\r\nAdams County\r\nYear Type Labor Force Annual Growth\r\nRate: Labor\r\nForce\r\nPersons Age\r\n16+\r\nAnnual Growth\r\nRate: Persons\r\nAge 16+\r\n2010 Estimate 236,117 324,027\r\n2015 Estimate 250,260 1.2% 363,866 2.6%\r\n2025 Forecast 307,080 1.9% 454,971 2.3%\r\nNote:\r\nSource: State Demography Office, Print Date: 04/07/2021\r\n19 The labor force participation and employment plot compares the percentage\r\nof persons age 16 and older in the labor force to the unemployment rate. The\r\npattern of labor force partipation and unemployment in Adams County are\r\nclosely related. The downward trend in labor force partipation is related to\r\nthe aging patterns in the county, along with the availability and character of\r\nemployment. Additionally, as unemployment falls, the incentive for people to\r\nenter the labor force increases.\r\n20",
      "content_url": "",
      "embedding": null,
      "source_metadata": {
        "source_name": "/media/jeremy/storage/bo20/2151932.pdf",
        "source_id": "/media/jeremy/storage/bo20/2151932.pdf",
        "source_location": "",
        "source_type": "PDF",
        "collection_id": "",
        "date_created": "2021-04-07T18:57:10",
        "last_modified": "2021-04-07T18:57:10",
        "summary": "",
        "partition_id": -1,
        "access_level": -1,
        "custom_content": null
      },
      "content_metadata": {
        "type": "text",
        "description": "Unstructured text from PDF document.",
        "page_number": -1,
        "hierarchy": {
          "page_count": 20,
          "page": -1,
          "block": -1,
          "line": -1,
          "span": -1,
          "nearby_objects": {
            "text": {
              "content": [],
              "bbox": [],
              "type": []
            },
            "images": {
              "content": [],
              "bbox": [],
              "type": []
            },
            "structured": {
              "content": [],
              "bbox": [],
              "type": []
            }
          }
        },
        "subtype": "",
        "start_time": -1,
        "end_time": -1,
        "custom_content": null
      },
      "audio_metadata": null,
      "text_metadata": {
        "text_type": "document",
        "summary": "",
        "keywords": "",
        "language": "en",
        "text_location": [
          -1,
          -1,
          -1,
          -1
        ],
        "text_location_max_dimensions": [
          -1,
          -1
        ],
        "custom_content": null
      },
      "image_metadata": null,
      "table_metadata": null,
      "chart_metadata": null,
      "error_metadata": null,
      "info_message_metadata": null,
      "debug_metadata": null,
      "raise_on_failure": false,
      "custom_content": null
    }
  }
]